MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECM124/mcu.h
extern volatile __IFS2bits_t IFS2bits __asm__ ("IFS2") __attribute__((section("sfrs"), address(0xBF810060)));
extern volatile uint32_t        IFS2CLR __attribute__((section("sfrs"),address(0xBF810064)));
extern volatile uint32_t        IFS2SET __attribute__((section("sfrs"),address(0xBF810068)));
extern volatile uint32_t        IFS2INV __attribute__((section("sfrs"),address(0xBF81006C)));
#define IFS3 IFS3
extern volatile uint32_t   IFS3 __attribute__((section("sfrs"), address(0xBF810070)));
typedef union {
  struct {
    uint32_t AD1D37IF:1;
    uint32_t AD1D38IF:1;
    uint32_t AD1D39IF:1;
    uint32_t AD1D40IF:1;
    uint32_t AD1D41IF:1;
    uint32_t AD1D42IF:1;
    uint32_t AD1D43IF:1;
    uint32_t AD1D44IF:1;
    uint32_t CPCIF:1;
    uint32_t CFDCIF:1;
    uint32_t SBIF:1;
    uint32_t CRPTIF:1;
    uint32_t :1;
    uint32_t SPI1EIF:1;
    uint32_t SPI1RXIF:1;
    uint32_t SPI1TXIF:1;
    uint32_t U1EIF:1;
    uint32_t U1RXIF:1;
    uint32_t U1TXIF:1;
    uint32_t I2C1BIF:1;
    uint32_t I2C1SIF:1;
    uint32_t I2C1MIF:1;
    uint32_t CNAIF:1;
    uint32_t CNBIF:1;
    uint32_t CNCIF:1;
    uint32_t CNDIF:1;
    uint32_t CNEIF:1;
    uint32_t CNFIF:1;
    uint32_t CNGIF:1;
    uint32_t CNHIF:1;
    uint32_t CNJIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS3bits_t;
extern volatile __IFS3bits_t IFS3bits __asm__ ("IFS3") __attribute__((section("sfrs"), address(0xBF810070)));
extern volatile uint32_t        IFS3CLR __attribute__((section("sfrs"),address(0xBF810074)));
extern volatile uint32_t        IFS3SET __attribute__((section("sfrs"),address(0xBF810078)));
extern volatile uint32_t        IFS3INV __attribute__((section("sfrs"),address(0xBF81007C)));
#define IFS4 IFS4
extern volatile uint32_t   IFS4 __attribute__((section("sfrs"), address(0xBF810080)));
typedef union {
  struct {
    uint32_t PMPIF:1;
    uint32_t PMPEIF:1;
    uint32_t CMP1IF:1;
    uint32_t CMP2IF:1;
    uint32_t USBIF:1;
    uint32_t USBDMAIF:1;
    uint32_t DMA0IF:1;
    uint32_t DMA1IF:1;
    uint32_t DMA2IF:1;
    uint32_t DMA3IF:1;
    uint32_t DMA4IF:1;
    uint32_t DMA5IF:1;
    uint32_t DMA6IF:1;
    uint32_t DMA7IF:1;
    uint32_t SPI2EIF:1;
    uint32_t SPI2RXIF:1;
    uint32_t SPI2TXIF:1;
    uint32_t U2EIF:1;
    uint32_t U2RXIF:1;
    uint32_t U2TXIF:1;
    uint32_t I2C2BIF:1;
    uint32_t I2C2SIF:1;
    uint32_t I2C2MIF:1;
    uint32_t CAN1IF:1;
    uint32_t CAN2IF:1;
    uint32_t ETHIF:1;
    uint32_t SPI3EIF:1;
    uint32_t SPI3RXIF:1;
    uint32_t SPI3TXIF:1;
    uint32_t U3EIF:1;
    uint32_t U3RXIF:1;
    uint32_t U3TXIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS4bits_t;
extern volatile __IFS4bits_t IFS4bits __asm__ ("IFS4") __attribute__((section("sfrs"), address(0xBF810080)));
extern volatile uint32_t        IFS4CLR __attribute__((section("sfrs"),address(0xBF810084)));
extern volatile uint32_t        IFS4SET __attribute__((section("sfrs"),address(0xBF810088)));
extern volatile uint32_t        IFS4INV __attribute__((section("sfrs"),address(0xBF81008C)));
#define IFS5 IFS5
extern volatile uint32_t   IFS5 __attribute__((section("sfrs"), address(0xBF810090)));
typedef union {
  struct {
    uint32_t I2C3BIF:1;
    uint32_t I2C3SIF:1;
    uint32_t I2C3MIF:1;
    uint32_t SPI4EIF:1;
    uint32_t SPI4RXIF:1;
    uint32_t SPI4TXIF:1;
    uint32_t RTCCIF:1;
    uint32_t FCEIF:1;
    uint32_t PREIF:1;
    uint32_t SQI1IF:1;
    uint32_t U4EIF:1;
    uint32_t U4RXIF:1;
    uint32_t U4TXIF:1;
    uint32_t I2C4BIF:1;
    uint32_t I2C4SIF:1;
    uint32_t I2C4MIF:1;
    uint32_t SPI5EIF:1;
    uint32_t SPI5RXIF:1;
    uint32_t SPI5TXIF:1;
    uint32_t U5EIF:1;
    uint32_t U5RXIF:1;
    uint32_t U5TXIF:1;
    uint32_t I2C5BIF:1;
    uint32_t I2C5SIF:1;
    uint32_t I2C5MIF:1;
    uint32_t SPI6IF:1;
    uint32_t SPI6RXIF:1;
    uint32_t SPI6TX:1;
    uint32_t U6EIF:1;
    uint32_t U6RXIF:1;
    uint32_t U6TXIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS5bits_t;
extern volatile __IFS5bits_t IFS5bits __asm__ ("IFS5") __attribute__((section("sfrs"), address(0xBF810090)));
extern volatile uint32_t        IFS5CLR __attribute__((section("sfrs"),address(0xBF810094)));
extern volatile uint32_t        IFS5SET __attribute__((section("sfrs"),address(0xBF810098)));
extern volatile uint32_t        IFS5INV __attribute__((section("sfrs"),address(0xBF81009C)));
#define IEC0 IEC0
extern volatile uint32_t   IEC0 __attribute__((section("sfrs"), address(0xBF8100C0)));
typedef union {
  struct {
    uint32_t CTIE:1;
    uint32_t CS0IE:1;
    uint32_t CS1IE:1;
    uint32_t INT0IE:1;
    uint32_t T1IE:1;
    uint32_t IC1EIE:1;
    uint32_t IC1IE:1;
    uint32_t OC1IE:1;
    uint32_t INT1IE:1;
    uint32_t T2IE:1;
    uint32_t IC2EIE:1;
    uint32_t IC2IE:1;
    uint32_t OC2IE:1;
    uint32_t INT2IE:1;
    uint32_t T3IE:1;
    uint32_t IC3EIE:1;
    uint32_t IC3IE:1;
    uint32_t OC3IE:1;
    uint32_t INT3IE:1;
    uint32_t T4IE:1;
    uint32_t IC4EIE:1;
    uint32_t IC4IE:1;
    uint32_t OC4IE:1;
    uint32_t INT4IE:1;
    uint32_t T5IE:1;
    uint32_t IC5EIE:1;
    uint32_t IC5IE:1;
    uint32_t OC5IE:1;
    uint32_t T6IE:1;
    uint32_t IC6EIE:1;
    uint32_t IC6IE:1;
    uint32_t OC6IE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC0bits_t;
extern volatile __IEC0bits_t IEC0bits __asm__ ("IEC0") __attribute__((section("sfrs"), address(0xBF8100C0)));
extern volatile uint32_t        IEC0CLR __attribute__((section("sfrs"),address(0xBF8100C4)));
extern volatile uint32_t        IEC0SET __attribute__((section("sfrs"),address(0xBF8100C8)));
extern volatile uint32_t        IEC0INV __attribute__((section("sfrs"),address(0xBF8100CC)));
#define IEC1 IEC1
extern volatile uint32_t   IEC1 __attribute__((section("sfrs"), address(0xBF8100D0)));
typedef union {
  struct {
    uint32_t T7IE:1;
    uint32_t IC7EIE:1;
    uint32_t IC7IE:1;
    uint32_t OC7IE:1;
    uint32_t T8IE:1;
    uint32_t IC8EIE:1;
    uint32_t IC8IE:1;
    uint32_t OC8IE:1;
    uint32_t T9IE:1;
    uint32_t IC9EIE:1;
    uint32_t IC9IE:1;
    uint32_t OC9IE:1;
    uint32_t AD1IE:1;
    uint32_t :1;
    uint32_t AD1DC1IE:1;
    uint32_t AD1DC2IE:1;
    uint32_t AD1DC3IE:1;
    uint32_t AD1DC4IE:1;
    uint32_t AD1DC5IE:1;
    uint32_t AD1DC6IE:1;
    uint32_t AD1DF1IE:1;
    uint32_t AD1DF2IE:1;
    uint32_t AD1DF3IE:1;
    uint32_t AD1DF4IE:1;
    uint32_t AD1DF5IE:1;
    uint32_t AD1DF6IE:1;
    uint32_t :1;
    uint32_t AD1D0IE:1;
    uint32_t AD1D1IE:1;
    uint32_t AD1D2IE:1;
    uint32_t AD1D3IE:1;
    uint32_t AD1D4IE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC1bits_t;
extern volatile __IEC1bits_t IEC1bits __asm__ ("IEC1") __attribute__((section("sfrs"), address(0xBF8100D0)));
extern volatile uint32_t        IEC1CLR __attribute__((section("sfrs"),address(0xBF8100D4)));
extern volatile uint32_t        IEC1SET __attribute__((section("sfrs"),address(0xBF8100D8)));
extern volatile uint32_t        IEC1INV __attribute__((section("sfrs"),address(0xBF8100DC)));
#define IEC2 IEC2
extern volatile uint32_t   IEC2 __attribute__((section("sfrs"), address(0xBF8100E0)));
typedef union {
  struct {
    uint32_t AD1D5IE:1;
    uint32_t AD1D6IE:1;
    uint32_t AD1D7IE:1;
    uint32_t AD1D8IE:1;
    uint32_t AD1D9IE:1;
    uint32_t AD1D10IE:1;
    uint32_t AD1D11IE:1;
    uint32_t AD1D12IE:1;
    uint32_t AD1D13IE:1;
    uint32_t AD1D14IE:1;
    uint32_t AD1D15IE:1;
    uint32_t AD1D16IE:1;
    uint32_t AD1D17IE:1;
    uint32_t AD1D18IE:1;
    uint32_t AD1D19IE:1;
    uint32_t AD1D20IE:1;
    uint32_t AD1D21IE:1;
    uint32_t AD1D22IE:1;
    uint32_t AD1D23IE:1;
    uint32_t AD1D24IE:1;
    uint32_t AD1D25IE:1;
    uint32_t AD1D26IE:1;
    uint32_t AD1D27IE:1;
    uint32_t AD1D28IE:1;
    uint32_t AD1D29IE:1;
    uint32_t AD1D30IE:1;
    uint32_t AD1D31IE:1;
    uint32_t AD1D32IE:1;
    uint32_t AD1D33IE:1;
    uint32_t AD1D34IE:1;
    uint32_t AD1D35IE:1;
    uint32_t AD1D36IE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC2bits_t;
extern volatile __IEC2bits_t IEC2bits __asm__ ("IEC2") __attribute__((section("sfrs"), address(0xBF8100E0)));
extern volatile uint32_t        IEC2CLR __attribute__((section("sfrs"),address(0xBF8100E4)));
extern volatile uint32_t        IEC2SET __attribute__((section("sfrs"),address(0xBF8100E8)));
extern volatile uint32_t        IEC2INV __attribute__((section("sfrs"),address(0xBF8100EC)));
#define IEC3 IEC3
extern volatile uint32_t   IEC3 __attribute__((section("sfrs"), address(0xBF8100F0)));
typedef union {
  struct {
    uint32_t AD1D37IE:1;
    uint32_t AD1D38IE:1;
    uint32_t AD1D39IE:1;
    uint32_t AD1D40IE:1;
    uint32_t AD1D41IE:1;
    uint32_t AD1D42IE:1;
    uint32_t AD1D43IE:1;
    uint32_t AD1D44IE:1;
    uint32_t CPCIE:1;
    uint32_t CFDCIE:1;
    uint32_t SBIE:1;
    uint32_t CRPTIE:1;
    uint32_t :1;
    uint32_t SPI1EIE:1;
    uint32_t SPI1RXIE:1;
    uint32_t SPI1TXIE:1;
    uint32_t U1EIE:1;
    uint32_t U1RXIE:1;
    uint32_t U1TXIE:1;
    uint32_t I2C1BIE:1;
    uint32_t I2C1SIE:1;
    uint32_t I2C1MIE:1;
    uint32_t CNAIE:1;
    uint32_t CNBIE:1;
    uint32_t CNCIE:1;
    uint32_t CNDIE:1;
    uint32_t CNEIE:1;
    uint32_t CNFIE:1;
    uint32_t CNGIE:1;
    uint32_t CNHIE:1;
    uint32_t CNJIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC3bits_t;
extern volatile __IEC3bits_t IEC3bits __asm__ ("IEC3") __attribute__((section("sfrs"), address(0xBF8100F0)));
extern volatile uint32_t        IEC3CLR __attribute__((section("sfrs"),address(0xBF8100F4)));
extern volatile uint32_t        IEC3SET __attribute__((section("sfrs"),address(0xBF8100F8)));
extern volatile uint32_t        IEC3INV __attribute__((section("sfrs"),address(0xBF8100FC)));
#define IEC4 IEC4
extern volatile uint32_t   IEC4 __attribute__((section("sfrs"), address(0xBF810100)));
typedef union {
  struct {
    uint32_t PMPIE:1;
    uint32_t PMPEIE:1;
    uint32_t CMP1IE:1;
    uint32_t CMP2IE:1;
    uint32_t USBIE:1;
    uint32_t USBDMAIE:1;
    uint32_t DMA0IE:1;
    uint32_t DMA1IE:1;
    uint32_t DMA2IE:1;
    uint32_t DMA3IE:1;
    uint32_t DMA4IE:1;
    uint32_t DMA5IE:1;
    uint32_t DMA6IE:1;
    uint32_t DMA7IE:1;
    uint32_t SPI2EIE:1;
    uint32_t SPI2RXIE:1;
    uint32_t SPI2TXIE:1;
    uint32_t U2EIE:1;
    uint32_t U2RXIE:1;
    uint32_t U2TXIE:1;
    uint32_t I2C2BIE:1;
    uint32_t I2C2SIE:1;
    uint32_t I2C2MIE:1;
    uint32_t CAN1IE:1;
    uint32_t CAN2IE:1;
    uint32_t ETHIE:1;
    uint32_t SPI3EIE:1;
    uint32_t SPI3RXIE:1;
    uint32_t SPI3TXIE:1;
    uint32_t U3EIE:1;
    uint32_t U3RXIE:1;
    uint32_t U3TXIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __IEC4bits_t;
