MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECM124/mcu.h
#define _IPC19_AD1D19IP_POSITION                 0x00000012
#define _IPC19_AD1D19IP_MASK                     0x001C0000
#define _IPC19_AD1D19IP_LENGTH                   0x00000003

#define _IPC19_AD1D20IS_POSITION                 0x00000018
#define _IPC19_AD1D20IS_MASK                     0x03000000
#define _IPC19_AD1D20IS_LENGTH                   0x00000002

#define _IPC19_AD1D20IP_POSITION                 0x0000001A
#define _IPC19_AD1D20IP_MASK                     0x1C000000
#define _IPC19_AD1D20IP_LENGTH                   0x00000003

#define _IPC19_w_POSITION                        0x00000000
#define _IPC19_w_MASK                            0xFFFFFFFF
#define _IPC19_w_LENGTH                          0x00000020

#define _IPC20_AD1D21IS_POSITION                 0x00000000
#define _IPC20_AD1D21IS_MASK                     0x00000003
#define _IPC20_AD1D21IS_LENGTH                   0x00000002

#define _IPC20_AD1D21IP_POSITION                 0x00000002
#define _IPC20_AD1D21IP_MASK                     0x0000001C
#define _IPC20_AD1D21IP_LENGTH                   0x00000003

#define _IPC20_AD1D22IS_POSITION                 0x00000008
#define _IPC20_AD1D22IS_MASK                     0x00000300
#define _IPC20_AD1D22IS_LENGTH                   0x00000002

#define _IPC20_AD1D22IP_POSITION                 0x0000000A
#define _IPC20_AD1D22IP_MASK                     0x00001C00
#define _IPC20_AD1D22IP_LENGTH                   0x00000003

#define _IPC20_AD1D23IS_POSITION                 0x00000010
#define _IPC20_AD1D23IS_MASK                     0x00030000
#define _IPC20_AD1D23IS_LENGTH                   0x00000002

#define _IPC20_AD1D23IP_POSITION                 0x00000012
#define _IPC20_AD1D23IP_MASK                     0x001C0000
#define _IPC20_AD1D23IP_LENGTH                   0x00000003

#define _IPC20_AD1D24IS_POSITION                 0x00000018
#define _IPC20_AD1D24IS_MASK                     0x03000000
#define _IPC20_AD1D24IS_LENGTH                   0x00000002

#define _IPC20_AD1D24IP_POSITION                 0x0000001A
#define _IPC20_AD1D24IP_MASK                     0x1C000000
#define _IPC20_AD1D24IP_LENGTH                   0x00000003

#define _IPC20_w_POSITION                        0x00000000
#define _IPC20_w_MASK                            0xFFFFFFFF
#define _IPC20_w_LENGTH                          0x00000020

#define _IPC21_AD1D25IS_POSITION                 0x00000000
#define _IPC21_AD1D25IS_MASK                     0x00000003
#define _IPC21_AD1D25IS_LENGTH                   0x00000002

#define _IPC21_AD1D25IP_POSITION                 0x00000002
#define _IPC21_AD1D25IP_MASK                     0x0000001C
#define _IPC21_AD1D25IP_LENGTH                   0x00000003

#define _IPC21_AD1D26IS_POSITION                 0x00000008
#define _IPC21_AD1D26IS_MASK                     0x00000300
#define _IPC21_AD1D26IS_LENGTH                   0x00000002

#define _IPC21_AD1D26IP_POSITION                 0x0000000A
#define _IPC21_AD1D26IP_MASK                     0x00001C00
#define _IPC21_AD1D26IP_LENGTH                   0x00000003

#define _IPC21_AD1D27IS_POSITION                 0x00000010
#define _IPC21_AD1D27IS_MASK                     0x00030000
#define _IPC21_AD1D27IS_LENGTH                   0x00000002

#define _IPC21_AD1D27IP_POSITION                 0x00000012
#define _IPC21_AD1D27IP_MASK                     0x001C0000
#define _IPC21_AD1D27IP_LENGTH                   0x00000003

#define _IPC21_AD1D28IS_POSITION                 0x00000018
#define _IPC21_AD1D28IS_MASK                     0x03000000
#define _IPC21_AD1D28IS_LENGTH                   0x00000002

#define _IPC21_AD1D28IP_POSITION                 0x0000001A
#define _IPC21_AD1D28IP_MASK                     0x1C000000
#define _IPC21_AD1D28IP_LENGTH                   0x00000003

#define _IPC21_w_POSITION                        0x00000000
#define _IPC21_w_MASK                            0xFFFFFFFF
#define _IPC21_w_LENGTH                          0x00000020

#define _IPC22_AD1D29IS_POSITION                 0x00000000
#define _IPC22_AD1D29IS_MASK                     0x00000003
#define _IPC22_AD1D29IS_LENGTH                   0x00000002

#define _IPC22_AD1D29IP_POSITION                 0x00000002
#define _IPC22_AD1D29IP_MASK                     0x0000001C
#define _IPC22_AD1D29IP_LENGTH                   0x00000003

#define _IPC22_AD1D30IS_POSITION                 0x00000008
#define _IPC22_AD1D30IS_MASK                     0x00000300
#define _IPC22_AD1D30IS_LENGTH                   0x00000002

#define _IPC22_AD1D30IP_POSITION                 0x0000000A
#define _IPC22_AD1D30IP_MASK                     0x00001C00
#define _IPC22_AD1D30IP_LENGTH                   0x00000003

#define _IPC22_AD1D31IS_POSITION                 0x00000010
#define _IPC22_AD1D31IS_MASK                     0x00030000
#define _IPC22_AD1D31IS_LENGTH                   0x00000002

#define _IPC22_AD1D31IP_POSITION                 0x00000012
#define _IPC22_AD1D31IP_MASK                     0x001C0000
#define _IPC22_AD1D31IP_LENGTH                   0x00000003

#define _IPC22_AD1D32IS_POSITION                 0x00000018
#define _IPC22_AD1D32IS_MASK                     0x03000000
#define _IPC22_AD1D32IS_LENGTH                   0x00000002

#define _IPC22_AD1D32IP_POSITION                 0x0000001A
#define _IPC22_AD1D32IP_MASK                     0x1C000000
#define _IPC22_AD1D32IP_LENGTH                   0x00000003

#define _IPC22_w_POSITION                        0x00000000
#define _IPC22_w_MASK                            0xFFFFFFFF
#define _IPC22_w_LENGTH                          0x00000020

#define _IPC23_AD1D33IS_POSITION                 0x00000000
#define _IPC23_AD1D33IS_MASK                     0x00000003
#define _IPC23_AD1D33IS_LENGTH                   0x00000002

#define _IPC23_AD1D33IP_POSITION                 0x00000002
#define _IPC23_AD1D33IP_MASK                     0x0000001C
#define _IPC23_AD1D33IP_LENGTH                   0x00000003

#define _IPC23_AD1D34IS_POSITION                 0x00000008
#define _IPC23_AD1D34IS_MASK                     0x00000300
#define _IPC23_AD1D34IS_LENGTH                   0x00000002

