MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECM124/mcu.h
#define _AD1CMPCON3_AINID_POSITION               0x00000008
#define _AD1CMPCON3_AINID_MASK                   0x00001F00
#define _AD1CMPCON3_AINID_LENGTH                 0x00000005

#define _AD1CMPCON4_IELOLO_POSITION              0x00000000
#define _AD1CMPCON4_IELOLO_MASK                  0x00000001
#define _AD1CMPCON4_IELOLO_LENGTH                0x00000001

#define _AD1CMPCON4_IELOHI_POSITION              0x00000001
#define _AD1CMPCON4_IELOHI_MASK                  0x00000002
#define _AD1CMPCON4_IELOHI_LENGTH                0x00000001

#define _AD1CMPCON4_IEHILO_POSITION              0x00000002
#define _AD1CMPCON4_IEHILO_MASK                  0x00000004
#define _AD1CMPCON4_IEHILO_LENGTH                0x00000001

#define _AD1CMPCON4_IEHIHI_POSITION              0x00000003
#define _AD1CMPCON4_IEHIHI_MASK                  0x00000008
#define _AD1CMPCON4_IEHIHI_LENGTH                0x00000001

#define _AD1CMPCON4_IEBTWN_POSITION              0x00000004
#define _AD1CMPCON4_IEBTWN_MASK                  0x00000010
#define _AD1CMPCON4_IEBTWN_LENGTH                0x00000001

#define _AD1CMPCON4_DCMPED_POSITION              0x00000005
#define _AD1CMPCON4_DCMPED_MASK                  0x00000020
#define _AD1CMPCON4_DCMPED_LENGTH                0x00000001

#define _AD1CMPCON4_DCMPGIEN_POSITION            0x00000006
#define _AD1CMPCON4_DCMPGIEN_MASK                0x00000040
#define _AD1CMPCON4_DCMPGIEN_LENGTH              0x00000001

#define _AD1CMPCON4_ENDCMP_POSITION              0x00000007
#define _AD1CMPCON4_ENDCMP_MASK                  0x00000080
#define _AD1CMPCON4_ENDCMP_LENGTH                0x00000001

#define _AD1CMPCON4_AINID_POSITION               0x00000008
#define _AD1CMPCON4_AINID_MASK                   0x00001F00
#define _AD1CMPCON4_AINID_LENGTH                 0x00000005

#define _AD1CMPCON5_IELOLO_POSITION              0x00000000
#define _AD1CMPCON5_IELOLO_MASK                  0x00000001
#define _AD1CMPCON5_IELOLO_LENGTH                0x00000001

#define _AD1CMPCON5_IELOHI_POSITION              0x00000001
#define _AD1CMPCON5_IELOHI_MASK                  0x00000002
#define _AD1CMPCON5_IELOHI_LENGTH                0x00000001

#define _AD1CMPCON5_IEHILO_POSITION              0x00000002
#define _AD1CMPCON5_IEHILO_MASK                  0x00000004
#define _AD1CMPCON5_IEHILO_LENGTH                0x00000001

#define _AD1CMPCON5_IEHIHI_POSITION              0x00000003
#define _AD1CMPCON5_IEHIHI_MASK                  0x00000008
#define _AD1CMPCON5_IEHIHI_LENGTH                0x00000001

#define _AD1CMPCON5_IEBTWN_POSITION              0x00000004
#define _AD1CMPCON5_IEBTWN_MASK                  0x00000010
#define _AD1CMPCON5_IEBTWN_LENGTH                0x00000001

#define _AD1CMPCON5_DCMPED_POSITION              0x00000005
#define _AD1CMPCON5_DCMPED_MASK                  0x00000020
#define _AD1CMPCON5_DCMPED_LENGTH                0x00000001

#define _AD1CMPCON5_DCMPGIEN_POSITION            0x00000006
#define _AD1CMPCON5_DCMPGIEN_MASK                0x00000040
#define _AD1CMPCON5_DCMPGIEN_LENGTH              0x00000001

#define _AD1CMPCON5_ENDCMP_POSITION              0x00000007
#define _AD1CMPCON5_ENDCMP_MASK                  0x00000080
#define _AD1CMPCON5_ENDCMP_LENGTH                0x00000001

#define _AD1CMPCON5_AINID_POSITION               0x00000008
#define _AD1CMPCON5_AINID_MASK                   0x00001F00
#define _AD1CMPCON5_AINID_LENGTH                 0x00000005

#define _AD1CMPCON6_IELOLO_POSITION              0x00000000
#define _AD1CMPCON6_IELOLO_MASK                  0x00000001
#define _AD1CMPCON6_IELOLO_LENGTH                0x00000001

#define _AD1CMPCON6_IELOHI_POSITION              0x00000001
#define _AD1CMPCON6_IELOHI_MASK                  0x00000002
#define _AD1CMPCON6_IELOHI_LENGTH                0x00000001

#define _AD1CMPCON6_IEHILO_POSITION              0x00000002
#define _AD1CMPCON6_IEHILO_MASK                  0x00000004
#define _AD1CMPCON6_IEHILO_LENGTH                0x00000001

#define _AD1CMPCON6_IEHIHI_POSITION              0x00000003
#define _AD1CMPCON6_IEHIHI_MASK                  0x00000008
#define _AD1CMPCON6_IEHIHI_LENGTH                0x00000001

#define _AD1CMPCON6_IEBTWN_POSITION              0x00000004
#define _AD1CMPCON6_IEBTWN_MASK                  0x00000010
#define _AD1CMPCON6_IEBTWN_LENGTH                0x00000001

#define _AD1CMPCON6_DCMPED_POSITION              0x00000005
#define _AD1CMPCON6_DCMPED_MASK                  0x00000020
#define _AD1CMPCON6_DCMPED_LENGTH                0x00000001

#define _AD1CMPCON6_DCMPGIEN_POSITION            0x00000006
#define _AD1CMPCON6_DCMPGIEN_MASK                0x00000040
#define _AD1CMPCON6_DCMPGIEN_LENGTH              0x00000001

#define _AD1CMPCON6_ENDCMP_POSITION              0x00000007
#define _AD1CMPCON6_ENDCMP_MASK                  0x00000080
#define _AD1CMPCON6_ENDCMP_LENGTH                0x00000001

#define _AD1CMPCON6_AINID_POSITION               0x00000008
#define _AD1CMPCON6_AINID_MASK                   0x00001F00
#define _AD1CMPCON6_AINID_LENGTH                 0x00000005

#define _AD1DATA0_DATA_POSITION                  0x00000000
#define _AD1DATA0_DATA_MASK                      0xFFFFFFFF
#define _AD1DATA0_DATA_LENGTH                    0x00000020

#define _AD1DATA1_DATA_POSITION                  0x00000000
#define _AD1DATA1_DATA_MASK                      0xFFFFFFFF
#define _AD1DATA1_DATA_LENGTH                    0x00000020

#define _AD1DATA2_DATA_POSITION                  0x00000000
#define _AD1DATA2_DATA_MASK                      0xFFFFFFFF
#define _AD1DATA2_DATA_LENGTH                    0x00000020

#define _AD1DATA3_DATA_POSITION                  0x00000000
#define _AD1DATA3_DATA_MASK                      0xFFFFFFFF
#define _AD1DATA3_DATA_LENGTH                    0x00000020

#define _AD1DATA4_DATA_POSITION                  0x00000000
#define _AD1DATA4_DATA_MASK                      0xFFFFFFFF
#define _AD1DATA4_DATA_LENGTH                    0x00000020

#define _AD1DATA5_DATA_POSITION                  0x00000000
#define _AD1DATA5_DATA_MASK                      0xFFFFFFFF
#define _AD1DATA5_DATA_LENGTH                    0x00000020

#define _AD1DATA6_DATA_POSITION                  0x00000000
#define _AD1DATA6_DATA_MASK                      0xFFFFFFFF
#define _AD1DATA6_DATA_LENGTH                    0x00000020

#define _AD1DATA7_DATA_POSITION                  0x00000000
#define _AD1DATA7_DATA_MASK                      0xFFFFFFFF
#define _AD1DATA7_DATA_LENGTH                    0x00000020

#define _AD1DATA8_DATA_POSITION                  0x00000000
#define _AD1DATA8_DATA_MASK                      0xFFFFFFFF
#define _AD1DATA8_DATA_LENGTH                    0x00000020

#define _AD1DATA9_DATA_POSITION                  0x00000000
#define _AD1DATA9_DATA_MASK                      0xFFFFFFFF
#define _AD1DATA9_DATA_LENGTH                    0x00000020

#define _AD1DATA10_DATA_POSITION                 0x00000000
#define _AD1DATA10_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA10_DATA_LENGTH                   0x00000020

#define _AD1DATA11_DATA_POSITION                 0x00000000
#define _AD1DATA11_DATA_MASK                     0xFFFFFFFF
#define _AD1DATA11_DATA_LENGTH                   0x00000020

